---
kind: property
id: P:Autodesk.Revit.DB.ParameterTypeId.TrussElementRotateChordsWithTruss
source: html/7c6e8447-9ca2-989b-4dfe-37d8340ca582.htm
---
# Autodesk.Revit.DB.ParameterTypeId.TrussElementRotateChordsWithTruss Property

"Rotate Chords With Truss"

## Syntax (C#)
```csharp
public static ForgeTypeId TrussElementRotateChordsWithTruss { get; }
```